In [ ]:
import sqlalchemy as sql
import random
import pandas as pd

data = pd.read_excel('./data.xlsx')

In [ ]:
# Lista de cidades do RJ
cidades_rj = [
    "Rio de Janeiro", "Niterói", "Petrópolis", "Nova Friburgo", "Teresópolis",
    "Volta Redonda", "Resende", "Barra Mansa", "Macaé", "Campos dos Goytacazes",
    "Angra dos Reis", "Cabo Frio", "Araruama", "São Gonçalo", "Itaboraí",
    "Magé", "Queimados", "Belford Roxo", "Duque de Caxias", "Nova Iguaçu"
]

# Lista de cidades de SP
cidades_sp = [
    "São Paulo", "Campinas", "Santos", "São Bernardo do Campo", "São José dos Campos",
    "Ribeirão Preto", "Sorocaba", "Santo André", "Osasco", "Jundiaí",
    "Bauru", "Piracicaba", "Franca", "Guarulhos", "Diadema",
    "Barueri", "Taboão da Serra", "Mogi das Cruzes", "Taubaté", "Suzano"
]

todas_cidades = cidades_rj + cidades_sp

estados = ['São Paulo', 'Rio de Janeiro']

# inserindo todas as cidades de SP e RJ na coluna 'Cidade'
data['Cidade'] = [random.choice(todas_cidades) for _ in range(data.shape[0])]
data['Estado'] = [random.choice(estados) for _ in range(data.shape[0])]
print(data)

In [ ]:
data['Sigla do estado'] = data['Estado'].apply(lambda x: 'SP' if x == 'São Paulo' else 'RJ')

In [ ]:
data['Idade'] = [random.randint(18, 60) for _ in range(data.shape[0])]

In [ ]:
names = [
    "Ana", "João", "Maria", "Pedro", "Lucas",
    "Beatriz", "Carlos", "Júlia", "Rafael", "Camila",
    "Gabriel", "Fernanda", "Matheus", "Larissa", "Bruno",
    "Mariana", "Henrique", "Luana", "Felipe", "Letícia"
]

data['Name'] = [random.choice(names) for _ in range(data.shape[0])]

In [35]:
# conectando em um banco de dados
engine = sql.create_engine('sqlite:///:memory:')
conn = engine.connect()
data.drop(columns=['ID.1', 'ID.2', 'ID.3'], inplace=True)
data.to_sql('clientes', conn, index=False, if_exists='replace')

242

In [ ]:
# função para consultas
def query(query, connection):
    query = pd.read_sql(query, connection)
    print(query)
    return query

In [36]:
q = '''
    select * from clientes;
'''
query(q, engine)

,ID,Name,Estado,Sigla do estado,Cidade,Saldo na conta,Idade,Total compras
0,0,Letícia,São Paulo,SP,Campinas,57734,20,1892.0
1,1,Henrique,São Paulo,SP,Nova Iguaçu,53809,31,737.0
2,2,Luana,São Paulo,SP,Angra dos Reis,14467,60,404.0
3,3,Beatriz,São Paulo,SP,Taubaté,49853,40,1372.0
4,4,Felipe,São Paulo,SP,Franca,18735,54,1052.0
...,...,...,...,...,...,...,...,...
237,237,Ana,Rio de Janeiro,RJ,Franca,28495,30,1630.0
238,238,Luana,São Paulo,SP,Itaboraí,68982,21,1729.0
239,239,Larissa,Rio de Janeiro,RJ,Bauru,57519,39,1265.0
240,240,Júlia,São Paulo,SP,Mogi das Cruzes,7824,24,1175.0
241,241,Mariana,São Paulo,SP,São José dos Campos,83156,57,415.0

In [30]:
data.to_excel('./data.xlsx', index_label="ID")